{"id":239,"date":"2012-01-11T02:01:45","date_gmt":"2012-01-11T07:01:45","guid":{"rendered":"https:\/\/masterwingchun.local\/?p=239"},"modified":"2020-09-06T22:53:55","modified_gmt":"2020-09-07T02:53:55","slug":"bone-hardening-and-muscle-conditioning","status":"publish","type":"post","link":"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/","title":{"rendered":"Wing Chun for Bone Hardening and Muscle Conditioning"},"content":{"rendered":"<p><a href=\"https:\/\/sifuochwingchun.com\/wp-content\/uploads\/2011\/12\/tampa-orlando-lakeland-florida-wooden-dummy-muk-yan-jong-mook-yan-jong-mu-ren-zhuang.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignright wp-image-778 size-medium\" title=\"tampa-orlando-lakeland-florida-wooden-dummy-muk-yan-jong-mook-yan-jong-mu-ren-zhuang\" src=\"https:\/\/sifuochwingchun.com\/wp-content\/uploads\/2011\/12\/tampa-orlando-lakeland-florida-wooden-dummy-muk-yan-jong-mook-yan-jong-mu-ren-zhuang-300x200.jpg\" alt=\"bone hardening and muscle conditioning\" width=\"300\" height=\"200\"><\/a>Kung Fu practitioners&nbsp;and&nbsp;great Chinese martial artists throughout the centuries have trained and practiced to gain the ability to withstand powerful blows and generate superior strength in all of their attacks. It&#8217;s this desire for bone hardening and muscle conditioning that forms the basis of those block-hitting and fantastical hits you see in martial arts movies. Chinese kung fu trains various hardening drills and breathing forms and techniques with the purpose to help you develop the hardening of your bones, muscles while gaining power, resilience, deterring pain and increasing your survival by empowering one of your primary tools in a fight.<\/p>\n<p>This article explores some tips, information and possible training exercises as well as some ways to assist healing if you choose to proceed in bone hardening and muscle conditioning for the martial arts. Kung fu is the best way to do your bone hardening and muscle conditioning. There are various way of bone hardening in martial arts. But kung fu is the best for bone hardening.&nbsp; In advise to&nbsp;bone hardening and muscle conditioning, you can use kung fu martial arts. <span class=\"st\">Kung Fu practitioners<\/span> is a great way of bone hardening and muscle conditioning in lakeland. This article is not a step by step guide but rather a collection of understandings, information and reasonable training methods that may be able to assist you now and in the future. We welcome your comments, additions and knowledge. You can do your bone hardening and muscle conditioning with Kung fu martial arts.&nbsp; Please comment as we believe knowledge truly is power, and those willing to read and act are most powerful indeed. (this article can not be copied or used on any other site)<\/p>\n<p>Many people call bone hardening and muscle conditioning by many different names, Okinawan Shorin-Ryu Karate calls it Tui-te. Some martial art stylists use maki wara boards (a board with hemp rope tied round it) you continually hit it and build up callouses on your knuckles, similar to hardening the skin on the heels of your foot and your hands. For doing your bone hardening and muscle conditioning, martial arts is only for you. Even without bone hardening and muscle conditioning Wing Chun provides techniques such as eye gouges, palm strikes, elbows, strikes and kicks to the knee, groin and ribs, wing chun provides a assortment of very effective and efficient techniques to assist you and your family in a dangerous situation on the street. Bone hardening is possible only with kung fu martial arts. Kung fu is proper way of&nbsp;bone hardening and muscle conditioning. Remember that body and bone hardening, muscle conditioning is not a replacement for realistic training and combat experience. Many people wants to do their bone hardening. This is supplemental training to add to your endurance, speed and current power that are all tools behind your skill and reflexes in a bad situation.<\/p>\n<h2>Body conditioning and Building Serious endurance<\/h2>\n<p>Overall body conditioning and building serious endurance is an extremely effective training method, it develops all aspects of a warrior and chinese martial art practitioner. We know that the human body was created to repair and rebuild any area that has been stressed or suffer injuries. Before attempting any kind of bone hardening, muscle conditioning or body hardening, first I recommend you train under a professional. Even though bone hardening and muscle conditioning is not new to the field of science any more or martial arts, not just everyone knows the proper and safest way of conditioning your body. You can do your bone hardening with kung fu martial arts. As I said first you need a martial art practitioner to train and teach you, training on your own without the proper instruction can be dangerous, you may not be conditioning at all but rather just killing your nerve endings. This brings me to the point, just because you killed your nerves and did possible permanent nerve damage by striking an object a thousand times doesn&#8217;t mean your shins are now steel, it just means you can&#8217;t feel anything. A professional will also be able to bring you to heights you may have never been able to bring yourself.<\/p>\n<p>Sifu Justin Och holds certifications from the Regan University, Spelendid Health International USA Holistic Association which was founded by Dr. Nelson Rios who trained under Bernard Jenson in Advanced Herbologist, Iridologist and Certifications as a Nutritional Health Coach. With proper supplements, diet, nutrition and sleep you can build a formidable body that supports not only the bones, joints and tendons but also the heart and vital organs during a confrontation. Proper sleep and nutrition helps the whole body not just the singled out area your working on. Kung fu martial arts also used for&nbsp;bone hardening and muscle conditioning. The human body is amazing and fascinating, it can heal itself and actually breaks down and rebuilds tissues and tendons from strenuous workouts in order to make the body stronger and resilient. In the 19th century German Anatomist\/Surgeon Julius Wolff developed a theory that stated that healthy bone will adapt to the loads it is placed under and if that load increases, the bone will remodel itself over time to become stronger to resist that sort of loading or training. For centuries Kung Fu practitioners and martial artists have known how to strengthen, harden and increase the strength of muscles and bones. Only recently has modern science started to understand, prove and investigate this well know practice. Bone hardening sounds like a scary word, it doesn&#8217;t sound like something you would want to do willingly.&nbsp; In bone hardening and muscle conditioning, you can still learn enough of the basic principles to safety condition. The truth is that taking care and increasing the hardness and density of your bones is not only smart for marital arts but could be a good safe guard against future falls or trama in the later years of your life. By eating properly, taking in the right supplements and doing proper and safe training you can really get some great results! Did you know that it has been shown that even doing Kung Fu forms such as Tai Chi or Wing Chun in slow motion can increase muscle density. Bone hardening is the finalized result of healing after you have created micro-fractures in your bones that can result from everything from hitting, striking, conditioning or even running. Whether you are training bone hardening on purpose for Muay Thai training, Wing Chun, Kickboxing or MMA Mixed Martial Arts, you will need time inbetween training and bone repair from the micro-fractures in order for it to harden. You can train on a Muay Thai bag every other day starting slow at first with your kicks and then gradually increasing the intensity and amount as you train. Remember not to overdo it in the beginning as you don&#8217;t want to break your legs or cause damage in the ankle or knee. You must listen to your body, if it says stop, then stop, if it say rest then rest, if it say get me a sandwich call someone quickly because your hallucinating and you might pass out.<\/p>\n<h2>Nerve damage, permanent damage and tips<\/h2>\n<p>Many practitioner&#8217;s use some of the old traditional ways of bone conditioning and bone hardening not remembering that these methods were made for people who live to a ripe old age of 30-35 years old. That means these methods did not consider a person living to the age of 80, 90 or 100+ years old, and so by using some of these methods you deaden nerves, do permanent damage, and could suffer agonizing pain, horrible arthritic conditions in the bones or joints or even partial disability. Wing Chun uses muscle and bond conditioning and hardening methods but they are gradual and safe, they may not get you results as fast but in life there are no short cuts that don&#8217;t come at a cost. You can still have the power and the results, while still being able to train them safely until the rip old “new age” of 110. There are students all over the world that are 80 and 90+ years old still practicing Wing Chun Kung Fu daily. This is the power of a life time of trained skill and power. Damaging your knee&#8217;s, neck, shoulders, wrists, back and ankles will only come back to haunt you years later.<\/p>\n<h3>Now on to the tips&#8230;<\/h3>\n<ol>\n<li>Striking your legs and arms with sticks, first start off slow then you can upgrade to hard wood or rattan sticks<\/li>\n<li>Using a rolling pin, bamboo stick, or bottle of glass over your shin up and down continuously<\/li>\n<li>Striking and Hitting a Muay Thai type bag, other bags can be used by I truly feel that the Muay Thai practitioners had it right, this is the best bag for shin and fist conditioning<\/li>\n<li>Striking focus pads and shields is good for beginners as well as intermediate training<\/li>\n<li>Along with focus pads, sand and rice bags are a great tool, they are usually mounted on walls wrapped in canvas and provide a great training tool.<\/li>\n<li>Wing Chun specifically uses the wooden dummy to condition the forearms, fists, shins, legs, feet and elbows. This type of conditioning can build arms that feel as strong as steel, other styles of kung fu and martial arts have purchased wooden dummies or even modified them, but many have no idea how to truly use them to increase there speed, power, structure, timing, technique and strengthen there bones, muscles and tissues. Under proper instruction from a Wing Chun master practitioner you can gain a lot from this Shaolin temple device. It is a centuries old tool made of hardwood with specific angles and uses, knowing your wooden dummy and how to use it properly can take you to whole new levels.<\/li>\n<li>Wing Chun also uses centuries old kung fu drills and techniques to build the arms and legs, drills that start of slow by lightly striking forearm to forearm using both the inside and outisde of the forearm to build both tendons, resistance to pain and the understanding of combat infliction on the body and its tools for combat.<\/li>\n<li>Make sure to massage the area and surrounding area that is being conditioned during and after training, hot Epsom salt bath&#8217;s will help to relax the body and increase blood flow and faster healing into the area.<\/li>\n<li>A good tiger balm (in a jar) or a good aged (1-3 year) Dit Da Jow is always a good investment, making your own is an even better investment. (if I get enough people that want the recipe I&#8217;ll post a good one on this site.<\/li>\n<li>All else fails and you can&#8217;t get a good tiger balm or good aged Dit Da Jow, my Grandmaster in Tai Chi from the Chen Village of Chen Style Tai Chi told me in secret once that a high quality, high grain vodka does the trick and I have found this to be true as well.<\/li>\n<li>Heat pad, that&#8217;s right the trusty old heat pad, place that sucker on the area of effect and feel the blood, nutrients, red and white blood cells do there job, a heat pad indicates to the body that you need help repairing this area, chinese medicine tells that we should avoid cold at all costs, think of it like this, your leg has been damaged from training much like a car accident on the high way, which is the best way to clean up the accident? Swelling which makes room for blood and nutrients to repair the area or an Ice Storm that freezes the accident, its victims, and the area&#8217;s of effect from those that could help. Use heat in moderation and it can help speed up your healing.<\/li>\n<li>Do not forget to stretch and do this this post work out regiment, if you are determined then the only thing that can truly hold you back is how fast you heal up so you can get back to your training.<\/li>\n<\/ol>\n<h2>Proper training vs Quick bone hardening and conditioning<\/h2>\n<p>I have heard of many ways to condition the body, the bones and muscle\/tendons, I have heard of skin conditioning where trainers use focus mitts or open hand palms to slap various parts of the body, such as the arms, midsection and legs. I have heard of people kicking shin to shin, striking the various parts of the body with there legs and arms until they are “conditioned” to take the pain. I have heard of practitioners of the martial arts actually striking each other as hard as they can in the midsection, thighs, shins, arms and even the head to build up so called “conditioning”. I do not know the legitimacy of this type of training, I do know that I have spoken to students of this type of training and many of them have had organs rearranged in a non-beneficial sense. They have spoken to me of lasting effects that have had them hospitalized at the most and watched by there primary doctor for other side effects and pain at the least. There is legend and mysticism wrapped up in the Master&#8217;s of old, there power and there abilities, but proper training is not mysticism. This is not mysticism or legend but can still be quite dangerous, as a practitioner of the martial arts and as a natural medicine practitioner, herbologist, iridologist and nutritional specialist I highly discourage this type of training. Strikes to the chest, stomach, head or organs to “toughen” them can have dire effects. Though It may seem great at first as results may seem at hand, but the damage you may do to internal organs being struck, shins and knees being battered, strikes to the head and the shock to the joints can lead to severe issues and problems later on in life. I try to make as many friends as I can in the martial arts, young and old, everyone has something to teach you. I have known so many martial art practitioner&#8217;s that have gone through this “type” of training, even under a professionals eyes which saddens me. They saw results for a time and then at the later years in life have had severe issues, join problems, pains, numbness throughout whole sections of there body. It is almost too much to think what these warriors of there time were able to accomplish and as they aged they suffer under the training that they once cherished. Train and condition the right way, train and condition yourself slow and safe, you have time don&#8217;t rush it, for fast results come at a cost.<\/p>\n<h2>Power and Unflinching determination for anyone<\/h2>\n<p>I had a semi-professional boxer who fought in the ring all the time come into my gym and was curious about the wall bags (canvas bags filled with sand) and kung fu, he saw the Wing Chun students striking the bags viciously with chain punches, turning punches, elbows, and palms. As a boxer he said that must be pretty easy and it looks like it could be a lot of fun, I&#8217;d like to give it a shot, after only 3 punches in he pulled back with pain in his knuckles, hands and wrist. He couldn&#8217;t understand why a small woman could hit it with rapid power and unflinching determination. Everyone and anyone at any stage of there training can gain both power and strength from further training. Even a professional can gain skill, hardening and knowledge, we all can.<\/p>\n<p>Many years later that same boxer contacted me up to let me know that the training and footwork he was provided had improved his ring fighting so notably that after bouts the other fighter was asking what he was doing and what he was training in. He said he felt very fortunate to have trained in Wing Chun and that his Kung Fu training had touched his life both professionally and personally. Even though his passion and work took him away from our school our teachings followed him, this is the purpose of Wing Chun, of Kung Fu, to improve the whole of your life.<\/p>\n<p>[fbcomments]<\/p>\n<p>For more info watch this <a href=\"https:\/\/www.youtube.com\/watch?v=TTh6yJPvQcY\">video<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Kung Fu practitioners&nbsp;and&nbsp;great Chinese martial artists throughout the centuries have trained and practiced to gain the ability to withstand powerful blows and generate superior strength in all of their attacks. It&#8217;s this desire for bone hardening and muscle conditioning that forms the basis of those block-hitting and fantastical hits you see in martial arts movies. [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":4008,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[3],"tags":[],"class":[2027],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Wing Chun for Bone Hardening and Muscle Conditioning<\/title>\n<meta name=\"description\" content=\"Great ways of Bone Hardening and Muscle Conditioning in Lakeland FL. Kung Fu practitioners, Great Chinese martial artist\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Wing Chun for Bone Hardening and Muscle Conditioning\" \/>\n<meta property=\"og:description\" content=\"Great ways of Bone Hardening and Muscle Conditioning in Lakeland FL. Kung Fu practitioners, Great Chinese martial artist\" \/>\n<meta property=\"og:url\" content=\"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/\" \/>\n<meta property=\"og:site_name\" content=\"Sifu Och Wing Chun\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sifuochwingchun\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/sifuochwingchun\" \/>\n<meta property=\"article:published_time\" content=\"2012-01-11T07:01:45+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-09-07T02:53:55+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/sifuochwingchun.s3.amazonaws.com\/wp-content\/uploads\/2020\/04\/24102447\/04.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"700\" \/>\n\t<meta property=\"og:image:height\" content=\"257\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Sifu Justin Och\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SifuOchWingChun\" \/>\n<meta name=\"twitter:site\" content=\"@SifuOchWingChun\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Sifu Justin Och\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"14 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/\",\"url\":\"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/\",\"name\":\"Wing Chun for Bone Hardening and Muscle Conditioning\",\"isPartOf\":{\"@id\":\"https:\/\/sifuochwingchun.com\/#website\"},\"datePublished\":\"2012-01-11T07:01:45+00:00\",\"dateModified\":\"2020-09-07T02:53:55+00:00\",\"author\":{\"@id\":\"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3\"},\"description\":\"Great ways of Bone Hardening and Muscle Conditioning in Lakeland FL. Kung Fu practitioners, Great Chinese martial artist\",\"breadcrumb\":{\"@id\":\"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/sifuochwingchun.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"News\",\"item\":\"https:\/\/sifuochwingchun.com\/category\/wing-chun-news\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Wing Chun for Bone Hardening and Muscle Conditioning\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/sifuochwingchun.com\/#website\",\"url\":\"https:\/\/sifuochwingchun.com\/\",\"name\":\"Sifu Och Wing Chun\",\"description\":\"Kung Fu and Martial Arts for Kids &amp; Adults in Lakeland, Florida\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/sifuochwingchun.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3\",\"name\":\"Sifu Justin Och\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/sifuochwingchun.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g\",\"caption\":\"Sifu Justin Och\"},\"description\":\"Sifu Justin Och has direct Ip Man lineage instruction under the Ip Ching, Ip Chun, Simon Lau, and Moy Yat system and spent his life training and advancing students in the Wing Chun Kung Fu system here in Lakeland Florida. He is also the Southeastern USA Regional Director of the World Ving Tsun Association for the America's.\",\"sameAs\":[\"https:\/\/sifuochwingchun.com\",\"https:\/\/www.facebook.com\/sifuochwingchun\",\"https:\/\/twitter.com\/SifuOchWingChun\"],\"url\":\"https:\/\/sifuochwingchun.com\/author\/justin-och\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Wing Chun for Bone Hardening and Muscle Conditioning","description":"Great ways of Bone Hardening and Muscle Conditioning in Lakeland FL. Kung Fu practitioners, Great Chinese martial artist","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/","og_locale":"en_US","og_type":"article","og_title":"Wing Chun for Bone Hardening and Muscle Conditioning","og_description":"Great ways of Bone Hardening and Muscle Conditioning in Lakeland FL. Kung Fu practitioners, Great Chinese martial artist","og_url":"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/","og_site_name":"Sifu Och Wing Chun","article_publisher":"https:\/\/www.facebook.com\/sifuochwingchun","article_author":"https:\/\/www.facebook.com\/sifuochwingchun","article_published_time":"2012-01-11T07:01:45+00:00","article_modified_time":"2020-09-07T02:53:55+00:00","og_image":[{"width":700,"height":257,"url":"https:\/\/sifuochwingchun.s3.amazonaws.com\/wp-content\/uploads\/2020\/04\/24102447\/04.jpg","type":"image\/jpeg"}],"author":"Sifu Justin Och","twitter_card":"summary_large_image","twitter_creator":"@SifuOchWingChun","twitter_site":"@SifuOchWingChun","twitter_misc":{"Written by":"Sifu Justin Och","Est. reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/","url":"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/","name":"Wing Chun for Bone Hardening and Muscle Conditioning","isPartOf":{"@id":"https:\/\/sifuochwingchun.com\/#website"},"datePublished":"2012-01-11T07:01:45+00:00","dateModified":"2020-09-07T02:53:55+00:00","author":{"@id":"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3"},"description":"Great ways of Bone Hardening and Muscle Conditioning in Lakeland FL. Kung Fu practitioners, Great Chinese martial artist","breadcrumb":{"@id":"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/sifuochwingchun.com\/bone-hardening-and-muscle-conditioning\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/sifuochwingchun.com\/"},{"@type":"ListItem","position":2,"name":"News","item":"https:\/\/sifuochwingchun.com\/category\/wing-chun-news\/"},{"@type":"ListItem","position":3,"name":"Wing Chun for Bone Hardening and Muscle Conditioning"}]},{"@type":"WebSite","@id":"https:\/\/sifuochwingchun.com\/#website","url":"https:\/\/sifuochwingchun.com\/","name":"Sifu Och Wing Chun","description":"Kung Fu and Martial Arts for Kids &amp; Adults in Lakeland, Florida","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/sifuochwingchun.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3","name":"Sifu Justin Och","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/sifuochwingchun.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g","caption":"Sifu Justin Och"},"description":"Sifu Justin Och has direct Ip Man lineage instruction under the Ip Ching, Ip Chun, Simon Lau, and Moy Yat system and spent his life training and advancing students in the Wing Chun Kung Fu system here in Lakeland Florida. He is also the Southeastern USA Regional Director of the World Ving Tsun Association for the America's.","sameAs":["https:\/\/sifuochwingchun.com","https:\/\/www.facebook.com\/sifuochwingchun","https:\/\/twitter.com\/SifuOchWingChun"],"url":"https:\/\/sifuochwingchun.com\/author\/justin-och\/"}]}},"_links":{"self":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/posts\/239"}],"collection":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/comments?post=239"}],"version-history":[{"count":0,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/posts\/239\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/media\/4008"}],"wp:attachment":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/media?parent=239"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/categories?post=239"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/tags?post=239"},{"taxonomy":"class","embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/class?post=239"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}