{"id":241,"date":"2012-01-11T02:06:48","date_gmt":"2012-01-11T07:06:48","guid":{"rendered":"https:\/\/masterwingchun.local\/?p=241"},"modified":"2020-09-06T22:53:42","modified_gmt":"2020-09-07T02:53:42","slug":"knowledge-of-martial-arts","status":"publish","type":"post","link":"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/","title":{"rendered":"Knowledge, Not Mysticism And The Martial Arts"},"content":{"rendered":"<p>It&#8217;s knowledge, not mysticism and the martial arts.&nbsp;This article is on the nature of martial arts as seen through Sifu Justin Och&#8217;s eyes and experience. This article give knowledge about the martial arts and the real generating force behind it; dedication to the goals we set forth in life. While we do that let us also speak about Sifu Och&#8217;s school of Wing Chun Kung Fu and the Martial Arts here in Lakeland, Florida. Well understood and true knowledge about proper diet, training, techniques and the persistence on building both the body and mind to new heights are always the goal. If you are interested in martial arts, you should have knowledge about it like its diet, techniques etc. Sifu Justin Och believes a educated student that can think and react for themselves is the best student. You should have knowledge about the principle elements of kung fu. Not a drone and not a mindless clone; for the martial arts to get better and for Wing Chun to grow we must educate our students to the best of their abilities and limits, may there dedication be ours. Knowledge of science is also useful for a kung fu men.&nbsp; Sifu Justin Och&#8217;s Wing Chun doesn&#8217;t play on the mystical or magical sides of Kung Fu mysticism in the martial arts. You should test your kung fu knowledge on time to time. Sifu Justin Och believes that the only thing that is mystical about the martial arts is the dedication and persistence it takes to gain a real hold and understanding to become a Master Practitioner.<\/p>\n<p>This is an informative article that applies directly to Sifu Justin Och&#8217;s Wing Chun, there are many who prey on the mysticism of the martial arts, the words and the history without any show or training to the degree of there knowledge and tales of what could be.&nbsp;<span class=\"st\">You are seeking a sense of truth and you need to learn what it is you seek and you will find it in the Fountain of Knowledge. In this article, there are many important things which give knowledge about kung fu martial arts.<\/span> Training and the Martial Arts is not about how much history you can speak of or how many people you weave into its winding philosophies, its about keeping the ones you love safe and improving the lives that each training session touches. We hope you enjoy our thoughts on the martial arts and how we perceive its benefits. (this article can not be copied or used on any other site)<\/p>\n<p>We have seen so many movies, shows and programs profess and feed off the “mystical almost supernatural” portions of kung fu and Asian\/Chinese marital arts. You should have kung fu knowledge for your safety purpose. We have seen people declare that they can tip toe on tree&#8217;s, hit people and knock them out from a distance purely with there chi and thought. People, including myself who have been brought up on these “super notions” are actually quite disappointed when you tell them its not true, much like the first time you found out about Santa. The reality though is much sweeter, with the right instruction, technique, body mechanics and pure diligence you will become stronger and faster then you may have dreamed.<\/p>\n<h2>Teaching the real aspects of Wing Chun Martial Arts<\/h2>\n<p>We recently put on a Wing Chun seminar and demonstration for the USA International Eastern Black Belt Hall of Fame. In this article, there is the knowledge of real aspects of wing chun martial arts. The reaction was two fold the first was “In less than an hour you debunked so many myths about Wing Chun as just a fast art with no power, control or purpose, I never knew.” and the other reaction was “where do you train and will you come to our school to do a seminar, I would love to learn”. This testimonials are from Master&#8217;s and Grandmaster&#8217;s highly respected, highly educated in the martial arts, with a huge respect from a style that teaches the true and real aspects that can be attained by anyone with the proper instructor, school and dedication.<\/p>\n<p>Not all schools are the same, just like not all Wing Chun Kung Fu schools are the same. Wing chun kung fu lakeland have the full knowledge of various martial arts. Any art can get a bad name from those who tout they know everything. You can also get knowledge abut the martial arts by joining the wing chun martial arts in lakeland. No one knows everything, everyone, everyday is growing. A tree is much like a person, once it stops growing it starts dieing. So many school owners and students claim to be Master&#8217;s and yet the actual time they have placed into a specific marital art before opening a school and collecting your money may be scarce. Second to that, a quote from a large martial art school owner and instructor out of Orlando; the masses don&#8217;t want real martial arts training and hard work, they want to feel good, get instant gratification, a pat on the back and be told they are doing real martial arts. Train them hard or teach them the real thing and they quit.” This same instructor then told me; you are like Sam Seltzer&#8217;s Steak House your school turns out top notch martial art and fitness instructors and practitioners, but how many people eat and seek out steak, they want McDonald&#8217;s. Now think about that, here is a great instructor, I know he is good but he has had to change his whole perspective to keep the doors open. As a client you make or break the schools in your area, if you didn&#8217;t want this type of training don&#8217;t pay for it, and eventually they will get better or they will go out of business.<\/p>\n<h2>Our Martial Art School is Not a belt factory.<\/h2>\n<p>I can give you a prime example, and you see what you feel after the scenario is done. A few months back I was to put on a quick Wing Chun martial art demonstration in downtown lakeland florida. After gathering the crowd around us, with many parents, kids and families I began to discuss Wing Chun and the difference between it and the many other schools of martial arts available today. Our martial arts school is not a belt factory here you can get full knowledge of martial arts. Our martial arts school is specializing in&nbsp;<span class=\"st\">relaying their skills and knowledge in a well- structured and easy to learn manner.<\/span> Everyone gathered in closer to hear and see what I was talking about, there were so many people that most asked me politely to speak up because they couldn&#8217;t hear in the back. People starting asking questions and getting more involved and excited about what we were talking about. I then explained that we do not give away belts every month and that they have to be earned, and that it is the skill achieved and not your belt color that was important. On that note over half of the people walked away, 50%!! Taking there children, husbands, girlfriends and family away because they would get a satin cloth every two months. I then starting show the speed and accuracy of Wing Chun, no fancy movements or kicks, just techniques and quick power that makes it so effective, fast and useful to any size or aged child, woman or adult. I explained anyone could attain this with hard work and dedication. I was now left standing around with about 8 people left, and out of those was one Kung Fu practitioner of another school, which I will speak about in a second. We all want the real stuff, we all want protection but you decide where you put your money and your time. Martial arts can reduce your stress and increase and improve your life and make you a happier healthier person. Our martial arts school give the full knowledge to improve your physical health. Kung fu also give the knowledge of positive mental maintenance to a men. Choosing the right school and the right teacher, not just the one that is the closest to you may be the hardest choice. Your time is invaluable and can never be replaced or returned. You can make the choice now or later, you can chose what will be best or convenient, but time well spent priceless.<\/p>\n<p>I recently had two amazingly respectful and courtesy new students join from a local martial art school here in lakeland, the school is huge and it even has a waiting list so they must have a great business model and have the money and opportunity to teach there students. These two were 13 year veteran black belts, who taught almost all of the martial art classes, did the demo teams, sparred and did all of the weapon training. These students during thanksgiving met up with one of there old friends; a student of ours with only eight months of training in our Wing Chun system, with no previous martial arts training or experience. When they found out he did Wing Chun they decided to spar and found out that there kicks and punches got shut down immediately. They spoke of this student of 8 months with high regard as they had heard of Wing Chun but had never seen it in action. They came in soon after and asked if they could join, they said they thought they were being shown self defense but found out there teacher had not decided to train them properly so he could keep them coming. After asking them how they were trained from day to day, month to month they discussed it with reluctance. I find that many people see the effectiveness of Wing Chun Kung Fu, but martial artists with previous training or experience have a deep love and respect for it.<\/p>\n<h2>No experience needed to train in martial arts<\/h2>\n<p><a href=\"https:\/\/sifuochwingchun.com\/wp-content\/uploads\/2012\/01\/DonMcnatt2.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignright size-full wp-image-330\" title=\"DonMcnatt2\" src=\"https:\/\/sifuochwingchun.com\/wp-content\/uploads\/2012\/01\/DonMcnatt2.jpg\" alt=\"\" width=\"298\" height=\"165\"><\/a>This isn&#8217;t to say that you need experience to do Wing Chun, in fact I have seen very effective practitioners come out of both sides of this coin. I have a Grandmaster Dr. Don McNatt who trained as a Marine in Okinawa Japan and has been training in the Shotokan Karate System for 60 years and he started over to train in Wing Chun Kung Fu and has been loving every moment of it. If you have no knowledge of martial arts, then no need to worry. Wing chun martial arts in for you.&nbsp; Does that mean his Shotokan Karate wasn&#8217;t effective? No by no means, he is a warrior of 80 years old and his punches and kicks would put “Kung Pow” holes in your body, but he saw how effective Kung Fu and specifically Wing Chun can be and he wanted that knowledge and skill. I have had students with no experience train and protect themselves against knives and horrible situations within a matter of months and years.<\/p>\n<p>Building a focused mind and a relentless work ethic in everything you wish to accomplish. Wing Chun will teach you the importance of proper nutrition and well balanced exercise to maintain proper weightloss or body conditioning. If you want to gain knowledge abut kung fu, you should join kung fu school in lakeland. I highly recommend everyone pursue the martial arts, its benefits are there for the taking, you just need the right instructor looking out for the best within you. They may be hard on you some days and fun with you the next, a good instructor is not perfect but seeks the perfection of what they see within you.<\/p>\n<h2>The Positive Mental and Physical Improvements<\/h2>\n<p>Few other activities in life provide you with so many positive benefits in both your mental and physical health. Wing Chun is a scientific based martial art system with decades of culture, self defense, and proven combative success. Though martial arts in general involve fighting techniques, physical exercise and discipline, mental focus and mind and body philosophical &amp; conceptual toughening. Wing Chun is the study of kung fu, culture and the art of the mind in its relation to the body the hard and soft, internal and external process by which we express ourselves. Wing Chun and Jeet Kune Do&#8217;s own Bruce Lee may have said it best “Artless art” is the artistic process within the artist; its meaning is “art of the soul.” All the various moves of all the tools means a step on the absolute aesthetic world of the soul.. Art is the way to the absolute and to the essence of human life”“Creation in art is the psychic unfolding of the personality, which is rooted in the nothing. Its effect is deenening of the personal dimension of the soul.”<\/p>\n<p>From standing meditation to breathing techniques, Wing Chun Martial Arts will greatly influence you and your life in extremely positive ways. So many books have come out declaring the use of marital arts strategy and the way of the warrior mindset in the office, boardroom, negotiations and personal and corporate buisness, used by high ranking CEO&#8217;s, Presidents and top performers. In a society that has so much information and technology flowing at there fingers tips we are finally starting to realize all the wonderful benefits the martial arts really has to offer us in every aspect of our lives.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It&#8217;s knowledge, not mysticism and the martial arts.&nbsp;This article is on the nature of martial arts as seen through Sifu Justin Och&#8217;s eyes and experience. This article give knowledge about the martial arts and the real generating force behind it; dedication to the goals we set forth in life. While we do that let us [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":410,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[3],"tags":[],"class":[2027],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Knowledge, not mysticism and the martial arts lakeland FL<\/title>\n<meta name=\"description\" content=\"Knowledge, Not Mysticism And The Martial Arts. This article is on the nature of martial arts as seen through Sifu Justin Och&#039;s eyes\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Knowledge, not mysticism and the martial arts lakeland FL\" \/>\n<meta property=\"og:description\" content=\"Knowledge, Not Mysticism And The Martial Arts. This article is on the nature of martial arts as seen through Sifu Justin Och&#039;s eyes\" \/>\n<meta property=\"og:url\" content=\"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/\" \/>\n<meta property=\"og:site_name\" content=\"Sifu Och Wing Chun\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sifuochwingchun\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/sifuochwingchun\" \/>\n<meta property=\"article:published_time\" content=\"2012-01-11T07:06:48+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-09-07T02:53:42+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/sifuochwingchun.s3.amazonaws.com\/wp-content\/uploads\/2012\/02\/24100921\/justin5.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"540\" \/>\n\t<meta property=\"og:image:height\" content=\"322\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Sifu Justin Och\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SifuOchWingChun\" \/>\n<meta name=\"twitter:site\" content=\"@SifuOchWingChun\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Sifu Justin Och\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/\",\"url\":\"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/\",\"name\":\"Knowledge, not mysticism and the martial arts lakeland FL\",\"isPartOf\":{\"@id\":\"https:\/\/sifuochwingchun.com\/#website\"},\"datePublished\":\"2012-01-11T07:06:48+00:00\",\"dateModified\":\"2020-09-07T02:53:42+00:00\",\"author\":{\"@id\":\"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3\"},\"description\":\"Knowledge, Not Mysticism And The Martial Arts. This article is on the nature of martial arts as seen through Sifu Justin Och's eyes\",\"breadcrumb\":{\"@id\":\"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/sifuochwingchun.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"News\",\"item\":\"https:\/\/sifuochwingchun.com\/category\/wing-chun-news\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Knowledge, Not Mysticism And The Martial Arts\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/sifuochwingchun.com\/#website\",\"url\":\"https:\/\/sifuochwingchun.com\/\",\"name\":\"Sifu Och Wing Chun\",\"description\":\"Kung Fu and Martial Arts for Kids &amp; Adults in Lakeland, Florida\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/sifuochwingchun.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3\",\"name\":\"Sifu Justin Och\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/sifuochwingchun.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g\",\"caption\":\"Sifu Justin Och\"},\"description\":\"Sifu Justin Och has direct Ip Man lineage instruction under the Ip Ching, Ip Chun, Simon Lau, and Moy Yat system and spent his life training and advancing students in the Wing Chun Kung Fu system here in Lakeland Florida. He is also the Southeastern USA Regional Director of the World Ving Tsun Association for the America's.\",\"sameAs\":[\"https:\/\/sifuochwingchun.com\",\"https:\/\/www.facebook.com\/sifuochwingchun\",\"https:\/\/twitter.com\/SifuOchWingChun\"],\"url\":\"https:\/\/sifuochwingchun.com\/author\/justin-och\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Knowledge, not mysticism and the martial arts lakeland FL","description":"Knowledge, Not Mysticism And The Martial Arts. This article is on the nature of martial arts as seen through Sifu Justin Och's eyes","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/","og_locale":"en_US","og_type":"article","og_title":"Knowledge, not mysticism and the martial arts lakeland FL","og_description":"Knowledge, Not Mysticism And The Martial Arts. This article is on the nature of martial arts as seen through Sifu Justin Och's eyes","og_url":"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/","og_site_name":"Sifu Och Wing Chun","article_publisher":"https:\/\/www.facebook.com\/sifuochwingchun","article_author":"https:\/\/www.facebook.com\/sifuochwingchun","article_published_time":"2012-01-11T07:06:48+00:00","article_modified_time":"2020-09-07T02:53:42+00:00","og_image":[{"width":540,"height":322,"url":"https:\/\/sifuochwingchun.s3.amazonaws.com\/wp-content\/uploads\/2012\/02\/24100921\/justin5.jpg","type":"image\/jpeg"}],"author":"Sifu Justin Och","twitter_card":"summary_large_image","twitter_creator":"@SifuOchWingChun","twitter_site":"@SifuOchWingChun","twitter_misc":{"Written by":"Sifu Justin Och","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/","url":"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/","name":"Knowledge, not mysticism and the martial arts lakeland FL","isPartOf":{"@id":"https:\/\/sifuochwingchun.com\/#website"},"datePublished":"2012-01-11T07:06:48+00:00","dateModified":"2020-09-07T02:53:42+00:00","author":{"@id":"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3"},"description":"Knowledge, Not Mysticism And The Martial Arts. This article is on the nature of martial arts as seen through Sifu Justin Och's eyes","breadcrumb":{"@id":"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/sifuochwingchun.com\/knowledge-of-martial-arts\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/sifuochwingchun.com\/"},{"@type":"ListItem","position":2,"name":"News","item":"https:\/\/sifuochwingchun.com\/category\/wing-chun-news\/"},{"@type":"ListItem","position":3,"name":"Knowledge, Not Mysticism And The Martial Arts"}]},{"@type":"WebSite","@id":"https:\/\/sifuochwingchun.com\/#website","url":"https:\/\/sifuochwingchun.com\/","name":"Sifu Och Wing Chun","description":"Kung Fu and Martial Arts for Kids &amp; Adults in Lakeland, Florida","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/sifuochwingchun.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3","name":"Sifu Justin Och","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/sifuochwingchun.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g","caption":"Sifu Justin Och"},"description":"Sifu Justin Och has direct Ip Man lineage instruction under the Ip Ching, Ip Chun, Simon Lau, and Moy Yat system and spent his life training and advancing students in the Wing Chun Kung Fu system here in Lakeland Florida. He is also the Southeastern USA Regional Director of the World Ving Tsun Association for the America's.","sameAs":["https:\/\/sifuochwingchun.com","https:\/\/www.facebook.com\/sifuochwingchun","https:\/\/twitter.com\/SifuOchWingChun"],"url":"https:\/\/sifuochwingchun.com\/author\/justin-och\/"}]}},"_links":{"self":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/posts\/241"}],"collection":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/comments?post=241"}],"version-history":[{"count":0,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/posts\/241\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/media\/410"}],"wp:attachment":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/media?parent=241"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/categories?post=241"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/tags?post=241"},{"taxonomy":"class","embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/class?post=241"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}