{"id":693,"date":"2012-07-25T01:52:34","date_gmt":"2012-07-25T05:52:34","guid":{"rendered":"https:\/\/masterwingchun.local\/?p=693"},"modified":"2020-09-06T22:51:54","modified_gmt":"2020-09-07T02:51:54","slug":"natural-help-for-adhd","status":"publish","type":"post","link":"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/","title":{"rendered":"Natural help for adhd \/ add through martial arts (adhd\/add kids focus)"},"content":{"rendered":"<h2><span style=\"font-size: x-large;\"><strong>Natural help for&nbsp;adhd \/add through martial arts<\/strong><\/span><br \/>\n<em><span style=\"font-size: small;\">Written by a Polk County school teacher who believes in Wing Chun Kung Fu Martial Arts in Downtown Lakeland This article was provided to Wing Chun Martial Arts, Kung Fu and Jiujitsu in Downtown, Lakeland “Wing Chun Martial Arts and Kung Fu” is run by Justin Och an Advanced Wing Chun Kung Fu practitioner with over 20+ years experience in the martial arts.&nbsp; Awarded by the USA Black Belt Hall of Fame “Inspirational Leader in Combative Wing Chun” and “Wing Chun Kung Fu Instructor of the Year”. Our Lakeland Martial Art School is located in Lakeland Florida (Polk County) at 116 east pine street, Lakeland Florida<\/span><\/em><\/h2>\n<p><span style=\"font-size: small;\">Natural help for adhd \/ add through martial arts instruction<\/span><\/p>\n<p><span style=\"font-size: small;\">These days you don’t have to look far to find children suffering&nbsp; from ADD, ADHD, and other sensory and mood disorders.&nbsp; Some have been&nbsp; carefully and expertly diagnosed.&nbsp; A large contingency of people feel&nbsp; that these diagnoses are handed out much too generously and without&nbsp; proper evaluation, however.&nbsp; A child can’t sit still in his or her&nbsp; seat, and they are promptly labeled.&nbsp; Parent’s are frustrated with&nbsp; speedy judgments and rightly so.&nbsp; But being desperate for help and&nbsp; worrying that their child’s social life is soon to be suffering,&nbsp; some tentatively resort to medication.<\/span><\/p>\n<p><span style=\"font-size: small;\">According to Medline Plus, a service of the National Library of&nbsp; Medicine, ADHD is more common in boys than girls, is hereditary, and&nbsp; symptoms must be present for at least six months for a true diagnosis&nbsp; to be considered.&nbsp; They also urge parents to get professional advice&nbsp; rather than making self diagnoses.<\/span><\/p>\n<p><span style=\"font-size: small;\">The most common symptoms of ADHD are hyperactivity, inattention or&nbsp; short attention span, impulsivity, short temper, and organizational&nbsp; challenges.&nbsp; ADD is much the same, minus the hyperactivity.&nbsp;&nbsp; Interestingly, these characteristics are present only when children&nbsp; are disinterested in the topic that they are being required to give&nbsp; attention to.&nbsp; According to helpguide.org “It isn’t that children&nbsp; with ADD\/ADHD can’t pay attention: When they’re doing things they&nbsp; enjoy or hearing about topics in which they’re interested, they&nbsp; have no trouble focusing and staying on task. But when the task is&nbsp; repetitive or boring, they quickly tune out.”<\/span><\/p>\n<p><span style=\"font-size: small;\">As a teacher, it is especially challenging trying to make <em>every <\/em>lesson sufficiently interesting and varied so as to keep <em>all <\/em>children engaged at <em>all <\/em>times.&nbsp; Even when I do my best,&nbsp; it’s often still not enough to prevent some “tuning out”.&nbsp;&nbsp; Children these days seem to lack the discipline it takes to stay in&nbsp; tune with their surroundings.&nbsp; Perhaps this is due to limited&nbsp; practice in doing so?<\/span><\/p>\n<p><span style=\"font-size: small;\">When I say discipline, I’m referring to the following definition:&nbsp;&nbsp; “<strong>training to<\/strong> <strong>act in accordance with rules<\/strong>;&nbsp; drill: military discipline”. It can also refer to <strong>“activity,&nbsp; exercise, or a regimen that develops or improves a skill;<\/strong><em><strong> training<\/strong><\/em><strong>.<\/strong><\/span><\/p>\n<p><span style=\"font-size: small;\">My personal belief (which is shared by a majority of my colleagues)&nbsp; is that overstimulation with media plays a big part in this “absence&nbsp; of discipline” for several reasons.&nbsp; Media is everywhere and easily&nbsp; accessible.&nbsp; Hand held games can be played while riding in the car.&nbsp;&nbsp; Kids text constantly, even while in class (says my son who shall not&nbsp; be named).&nbsp; The internet can be accessed by phone.&nbsp; What better way&nbsp; to keep kids quiet and entertained?&nbsp;&nbsp; It’s an “instant oatmeal&nbsp; world” as my husband calls it. How can we teachers compare to that?&nbsp;&nbsp; We’re not animated, we don’t have sound effects, and&nbsp; unfortunately for our students they can’t “turn us off” when&nbsp; they’re tired of us.&nbsp; Whatever happened to good old fresh air and&nbsp; sunshine?&nbsp; Climbing trees?&nbsp; Doing things as a family?<\/span><\/p>\n<p><span style=\"font-size: small;\">Over-use of technology is attributed to another growing concern when&nbsp; it comes to children: obesity.&nbsp; Statistics say that cases of&nbsp; childhood obesity are becoming more and more prevalent.&nbsp; Not only do&nbsp; extremely overweight children have to endure humiliation, taunting&nbsp; and teasing from peers, they are at increased risk for a myriad of&nbsp; health issues.&nbsp; Type II diabetes, high cholesterol, high blood&nbsp; pressure, and sleep apnea sound like conditions only an adult would&nbsp; have to suffer.&nbsp; However the occurrence of these health problems is&nbsp; increasing at an alarming rate.&nbsp; In addition, these children are at&nbsp; higher risk of developing, liver diseases, orthopedic problems and&nbsp; asthma.&nbsp; Many continue to struggle with their weight even into&nbsp; adulthood.<\/span><\/p>\n<p><span style=\"font-size: small;\">No matter where you look for support,&nbsp; all sources will recommend some basic guidelines.&nbsp; Eat healthy meals&nbsp; in appropriate proportions, have healthy snack choices available,&nbsp; limit “screen time”, and <em><strong>exercise daily. <\/strong><\/em>If you&nbsp; suspect that your child might be carrying too much weight you can go&nbsp; online to any BMI calculator website, plug in your child’s&nbsp; information, and see how he or she measures up.&nbsp;&nbsp; BMI stands for Body&nbsp; Mass Index, is calculated using a person’s weight and height, and&nbsp; is a fairly reliable indicator of body fatness for most people.<\/span><\/p>\n<p><span style=\"font-size: small;\">Whether your child has a professionally evaluated case of condition&nbsp; “X” or simply has an overabundance of energy, why not consider an&nbsp; exercise program that is beneficial for children in general,&nbsp; ESPECIALLY those with specific needs, and for the whole family as a&nbsp; unit?&nbsp; Not as a cure, but as an aid to developing discipline, keeping&nbsp; weight in check, and increasing self-esteem<\/span><\/p>\n<p><span style=\"font-size: small;\">One obvious choice is martial arts.&nbsp; Of course while participating in&nbsp; any group activity the technology would have to be put aside for 30&nbsp; to 60 minutes.&nbsp; But tell your kids it will be well worth the&nbsp; sacrifice.&nbsp; They’ll get all of the above benefits, and all the&nbsp; while have IMMENSE fun!&nbsp; Not all martial arts programs are the same,&nbsp; however.&nbsp; So how do you go about finding the right one?&nbsp; My advice as&nbsp; a mother of three and teacher of many is to actually go to a martial&nbsp; arts center; ask a lot of questions, watch an actual class.&nbsp; See what&nbsp; fits you\/your family best.<\/span><\/p>\n<p><span style=\"font-size: small;\">There are several in Lakeland,&nbsp; including one that I’m personally very fond of; <strong>Master Wing Chun&nbsp; Martial Arts<\/strong> <strong>on downtown Pine Street.<\/strong> What I like about&nbsp; this particular facility is their mission statement.&nbsp; Owner Justin&nbsp; Och boasts that his program offers Martial Arts with a purpose; <em><strong>practical skills<\/strong><\/em> rather than flamboyant moves are&nbsp; taught.&nbsp; He has been employed previously by other martial arts&nbsp; centers that teach “fancy moves”, kicks, and punches. This&nbsp; experience is what prompted him to open his own place.&nbsp; Adults and&nbsp; children alike will learn self defense moves.&nbsp; Adults will be taught&nbsp; to protect themselves from other adults; children against potential&nbsp; kidnappers and the “choke holds” other kids might put on them&nbsp; (which Mr. Och says is becoming quite common).&nbsp; After people have had&nbsp; training in handling a sword or knife they’ll know how to use it,&nbsp; not just twirl it around for show.<\/span><\/p>\n<p><span style=\"font-size: small;\">I actually came across Master Wing Chun&nbsp; when seeking out guidance from an herbologist (Justin Och) for some&nbsp; health issues. I personally have not taken a class yet, but am&nbsp; anxious to do so after my daughter and I witnessed a class! We were&nbsp; so excited about signing up that we went home and told the rest of&nbsp; the family about it.&nbsp; Now, they want to try it as well.<\/span><\/p>\n<p><span style=\"font-size: small;\">Several classes are offered at <strong>Master&nbsp; Wing Chun Martial Arts<\/strong>, including Kung Fu, Kickboxing, Self&nbsp; Defense, Boot Camp and more.&nbsp; Everyone is welcome whether you are an&nbsp; adult, child, beginner or if you have experience in martial arts.&nbsp;&nbsp; Seven to ten instructors are present during any given class, so&nbsp; personal attention is available at all times.&nbsp; Check out their&nbsp; website for pictures, videos, and details on classes.<\/span><\/p>\n<p><span style=\"font-size: small;\">Sifu (meaning “master” or&nbsp; “teacher”- pronounced “see – fu”) Och is personable and&nbsp; friendly, yet at the same time he is quite intense, and passionate&nbsp; about sharing his knowledge.&nbsp; Not only is he a master at martial&nbsp; arts, he is a trained iridologist and herbologist, and can assist you&nbsp; with health and weight loss issues.&nbsp; After one conversation you’ll&nbsp; realize that he offers a wealth of knowledge.&nbsp; If you happen to stop&nbsp; by while a class is taking place, be prepared to be impressed!&nbsp;&nbsp; Students are friendly, focused, and without a doubt thrilled to be&nbsp; there.<\/span><\/p>\n<p><span style=\"font-size: small;\">Children reap the benefits&nbsp; and create healthy habits that will follow them throughout their&nbsp; lives:<\/span><\/p>\n<p><span style=\"font-size: small;\"><strong>RESPECT:<\/strong> Children learn to bow&nbsp; to the masters who came before them, and to their current&nbsp; instructors. They also learn to treat other students as they wish to&nbsp; be treated.<\/span><\/p>\n<p><span style=\"font-size: small;\">According to parenting.com many&nbsp; parents whose children have ADHD state that their kids have had <strong>great&nbsp; success<\/strong> with these types of programs because <strong>self-control and&nbsp; concentration<\/strong> are the precise skills that need development.&nbsp; But,&nbsp; say experts, it&#8217;s the <strong>respect<\/strong> kids learn that can be the most&nbsp; important benefit: It often carries over into school, helping to&nbsp; improve behavior and even grades, according to recent research.<\/span><\/p>\n<p><span style=\"font-size: small;\">R-E-S-P-E-C-T….As a teacher, that’s&nbsp; GREAT news for me!&nbsp; It’s Great news all the way around, actually.&nbsp;&nbsp; Imagine less negative feedback and more positive feedback from your&nbsp; child’s teacher.&nbsp; Imagine your child showing you and others more&nbsp; respect.&nbsp; Imagine your child bringing home better grades due to his&nbsp; increased ability to focus, and the self-pride that goes hand in hand&nbsp; with an impressive report card!<\/span><\/p>\n<p><span style=\"font-size: small;\"><strong>FITNESS: <\/strong>The movements of the&nbsp; martial art itself often challenge your muscles and cardiovascular&nbsp; system. Martial artists are known for being toned, flexible and&nbsp; physically fit.<\/span><\/p>\n<p><span style=\"font-size: small;\"><strong>SELF DEFENSE:<\/strong> The ability to&nbsp; defend yourself against an assailant is an empowering feeling. Master&nbsp; Wing Chun Martial Arts uses self defense as a cornerstone of the&nbsp; entire program.<\/span><\/p>\n<p><span style=\"font-size: small;\"><strong>SELF DISCIPLINE<\/strong>: Martial&nbsp; arts help instill mental focus in your child, giving her the ability&nbsp; to concentrate on a task and see it through to its conclusion.<\/span><\/p>\n<p><span style=\"font-size: small;\"><strong>SELF&nbsp; CONFIDENCE:<\/strong> A child who is&nbsp; involved in martial arts is generally a child who is confident in&nbsp; herself. Martial Arts helps a child develop measurable goals to&nbsp; follow that are realistic to attain. The sense of accomplishment a&nbsp; child feels by mastering a new technique follows him everywhere he&nbsp; goes.<\/span><\/p>\n<p align=\"center\"><span style=\"font-size: small;\">&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;<\/span><\/p>\n<p><span style=\"font-size: small;\">Take the time to stop by and chat with&nbsp; Sifu Och.&nbsp; If you don’t, you’ll be missing out on an opportunity&nbsp; of a lifetime.&nbsp; As he puts it, “There’s only so much time in a&nbsp; day.&nbsp; How are you going to invest it?”&nbsp; He issues a warning,&nbsp; however:<\/span><\/p>\n<p align=\"CENTER\"><span style=\"font-size: small;\">ATTENDING&nbsp; WING CHUN MAY GET YOU IN THE BEST SHAPE OF YOUR LIFE, MAKE YOU A BETTER PERSON INSIDE AND OUT. YOU WILL AFFECT OTHERS IN POSITIVE WAY WHILE LEARNING A LIFE SKILL THAT MAY ONE DAY SAVE YOU OR YOUR LOVED ONES&nbsp; LIFE.<\/span><\/p>\n<p><span style=\"font-size: small;\">a non-paid article written by<strong> Cheryl Pace<\/strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/span><\/p>\n<p><span style=\"font-size: small;\">Teacher, ADHD\/ADD child assistant, Writer<\/span><\/p>\n<p><span style=\"font-size: small;\"><strong>Natural Help for ADHD\/ADD Through Martial Arts<\/strong> <\/span><\/p>\n<p>For more info watch this <a href=\"https:\/\/www.youtube.com\/watch?v=zH_2Hcztj9E\">videos<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Natural help for&nbsp;adhd \/add through martial arts Written by a Polk County school teacher who believes in Wing Chun Kung Fu Martial Arts in Downtown Lakeland This article was provided to Wing Chun Martial Arts, Kung Fu and Jiujitsu in Downtown, Lakeland “Wing Chun Martial Arts and Kung Fu” is run by Justin Och an [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":3656,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[3],"tags":[],"class":[2029],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>natural help for adhd \/ add through martial arts<\/title>\n<meta name=\"description\" content=\"natural help for adhd \/ add martial arts, natural help for adhd,add, adhd, help for adhd, help for add, martial arts adhd, adhd martial arts\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"natural help for adhd \/ add through martial arts\" \/>\n<meta property=\"og:description\" content=\"natural help for adhd \/ add martial arts, natural help for adhd,add, adhd, help for adhd, help for add, martial arts adhd, adhd martial arts\" \/>\n<meta property=\"og:url\" content=\"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/\" \/>\n<meta property=\"og:site_name\" content=\"Sifu Och Wing Chun\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sifuochwingchun\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/sifuochwingchun\" \/>\n<meta property=\"article:published_time\" content=\"2012-07-25T05:52:34+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-09-07T02:51:54+00:00\" \/>\n<meta name=\"author\" content=\"Sifu Justin Och\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SifuOchWingChun\" \/>\n<meta name=\"twitter:site\" content=\"@SifuOchWingChun\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Sifu Justin Och\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/\",\"url\":\"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/\",\"name\":\"natural help for adhd \/ add through martial arts\",\"isPartOf\":{\"@id\":\"https:\/\/sifuochwingchun.com\/#website\"},\"datePublished\":\"2012-07-25T05:52:34+00:00\",\"dateModified\":\"2020-09-07T02:51:54+00:00\",\"author\":{\"@id\":\"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3\"},\"description\":\"natural help for adhd \/ add martial arts, natural help for adhd,add, adhd, help for adhd, help for add, martial arts adhd, adhd martial arts\",\"breadcrumb\":{\"@id\":\"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/sifuochwingchun.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"News\",\"item\":\"https:\/\/sifuochwingchun.com\/category\/wing-chun-news\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Natural help for adhd \/ add through martial arts (adhd\/add kids focus)\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/sifuochwingchun.com\/#website\",\"url\":\"https:\/\/sifuochwingchun.com\/\",\"name\":\"Sifu Och Wing Chun\",\"description\":\"Kung Fu and Martial Arts for Kids &amp; Adults in Lakeland, Florida\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/sifuochwingchun.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3\",\"name\":\"Sifu Justin Och\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/sifuochwingchun.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g\",\"caption\":\"Sifu Justin Och\"},\"description\":\"Sifu Justin Och has direct Ip Man lineage instruction under the Ip Ching, Ip Chun, Simon Lau, and Moy Yat system and spent his life training and advancing students in the Wing Chun Kung Fu system here in Lakeland Florida. He is also the Southeastern USA Regional Director of the World Ving Tsun Association for the America's.\",\"sameAs\":[\"https:\/\/sifuochwingchun.com\",\"https:\/\/www.facebook.com\/sifuochwingchun\",\"https:\/\/twitter.com\/SifuOchWingChun\"],\"url\":\"https:\/\/sifuochwingchun.com\/author\/justin-och\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"natural help for adhd \/ add through martial arts","description":"natural help for adhd \/ add martial arts, natural help for adhd,add, adhd, help for adhd, help for add, martial arts adhd, adhd martial arts","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/","og_locale":"en_US","og_type":"article","og_title":"natural help for adhd \/ add through martial arts","og_description":"natural help for adhd \/ add martial arts, natural help for adhd,add, adhd, help for adhd, help for add, martial arts adhd, adhd martial arts","og_url":"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/","og_site_name":"Sifu Och Wing Chun","article_publisher":"https:\/\/www.facebook.com\/sifuochwingchun","article_author":"https:\/\/www.facebook.com\/sifuochwingchun","article_published_time":"2012-07-25T05:52:34+00:00","article_modified_time":"2020-09-07T02:51:54+00:00","author":"Sifu Justin Och","twitter_card":"summary_large_image","twitter_creator":"@SifuOchWingChun","twitter_site":"@SifuOchWingChun","twitter_misc":{"Written by":"Sifu Justin Och","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/","url":"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/","name":"natural help for adhd \/ add through martial arts","isPartOf":{"@id":"https:\/\/sifuochwingchun.com\/#website"},"datePublished":"2012-07-25T05:52:34+00:00","dateModified":"2020-09-07T02:51:54+00:00","author":{"@id":"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3"},"description":"natural help for adhd \/ add martial arts, natural help for adhd,add, adhd, help for adhd, help for add, martial arts adhd, adhd martial arts","breadcrumb":{"@id":"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/sifuochwingchun.com\/natural-help-for-adhd\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/sifuochwingchun.com\/"},{"@type":"ListItem","position":2,"name":"News","item":"https:\/\/sifuochwingchun.com\/category\/wing-chun-news\/"},{"@type":"ListItem","position":3,"name":"Natural help for adhd \/ add through martial arts (adhd\/add kids focus)"}]},{"@type":"WebSite","@id":"https:\/\/sifuochwingchun.com\/#website","url":"https:\/\/sifuochwingchun.com\/","name":"Sifu Och Wing Chun","description":"Kung Fu and Martial Arts for Kids &amp; Adults in Lakeland, Florida","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/sifuochwingchun.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3","name":"Sifu Justin Och","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/sifuochwingchun.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g","caption":"Sifu Justin Och"},"description":"Sifu Justin Och has direct Ip Man lineage instruction under the Ip Ching, Ip Chun, Simon Lau, and Moy Yat system and spent his life training and advancing students in the Wing Chun Kung Fu system here in Lakeland Florida. He is also the Southeastern USA Regional Director of the World Ving Tsun Association for the America's.","sameAs":["https:\/\/sifuochwingchun.com","https:\/\/www.facebook.com\/sifuochwingchun","https:\/\/twitter.com\/SifuOchWingChun"],"url":"https:\/\/sifuochwingchun.com\/author\/justin-och\/"}]}},"_links":{"self":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/posts\/693"}],"collection":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/comments?post=693"}],"version-history":[{"count":0,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/posts\/693\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/media?parent=693"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/categories?post=693"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/tags?post=693"},{"taxonomy":"class","embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/class?post=693"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}