{"id":701,"date":"2012-07-25T11:11:07","date_gmt":"2012-07-25T15:11:07","guid":{"rendered":"https:\/\/masterwingchun.local\/?p=701"},"modified":"2020-09-06T22:51:45","modified_gmt":"2020-09-07T02:51:45","slug":"weaknesses-wing-chun-sucks","status":"publish","type":"post","link":"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/","title":{"rendered":"Why people may tell you Wing Chun Sucks&#8230;."},"content":{"rendered":"<h2>Why people say not to train in Wing Chun and the weaknesses of Wing Chun or Wing Chun Sucks&nbsp;&#8230;<\/h2>\n<p>Misleading reports, fake&nbsp;instructors with only&nbsp;bits and pieces of Wing Chun (Ving Tsun), difficulty finding a real wing chun instructor and martial artist attempting to teach youtube wing chun kung fu within their schools without any real training and teachers telling students they don&#8217;t need to spar or use techniques against resistance to &#8220;truly understand and learn wing chun&#8221;.<\/p>\n<p>But once you visit a good Wing Chun School you can not deny the direct effectiveness of the style.&nbsp; I have seen people online blogging and telling prospective students and readers that Wing Chun Sucks (Ving Tsun sucks) without even knowing the system.&nbsp;&nbsp;Anonymous individuals write in blogs and article spots online claiming expertise, possibly real or false&nbsp;martial art backgrounds and experiences&nbsp;and expressing to you what you should and shouldn&#8217;t do with your life and self defense goals. Because as a society individuals love to feed, perpetuate and spread what negative rumors and things they have heard or read instead of checking on the facts for themselves.<\/p>\n<p>By listening to blogs or the opinions of friends you will never discover what you want, instead go and try out the school and see if the techniques really make sense in a high stress enviroment aginst a large aggressive attacker.&nbsp; If not you may soon find yourself at a belt factory, quickly working your way up the chain gaining belts but not skills, ability and real life self protection.&nbsp; Every school is different, I have students that have spent 30-50+ years in the martial arts, 7th Dan in Shotokan Karate, 6th, 5th,&nbsp;3rd&nbsp;dans in Taekwondo, Judo, blackbelts and ex-marines, rangers and practitioners in mma (mixed martial arts) and Krav Maga.&nbsp; I have heard them all talk about how what they trained in wasn&#8217;t anywhere close to as effective as what they have seen in our Wing Chun Kung Fu School.&nbsp; Does that mean that Wing Chun is better than these arts, no.&nbsp; What it means is that where ever they trained their instructor restricted them, or did not teach them, push them or maybe even understand how to apply the techniques in a real fashion. Or maybe they were commercialized and didn&#8217;t want to lose students by making things to difficult which many commercialized schools know happens if you push and train your students to hard.&nbsp; To find a really good martial art school you have to go through many bad, poor and&nbsp;mediocre ones in order to find a great one!&nbsp;&nbsp;Even then,&nbsp;It is not the style that fights it is the practitioner, the more dedication, time and hard practice you place in the more you will recieve.&nbsp; But placing your time and dedication into&nbsp;a poor or mediocre school will have you wasting time and money.&nbsp; Seek out a great martial art school to maximize your results and self defense protection.<\/p>\n<p>But many don&#8217;t do this, they read a article and blog written by other practitioners of other styles of marials arts expressly telling you that <em>you should train in anything, I mean anything but Wing Chun (Ving Tsun) don&#8217;t do it,&nbsp;do a commercialized martial art school that is really close to you and doesn&#8217;t require much effort. Do any another style, but don&#8217;t go down and even look at it yourself, don&#8217;t make up your own mind&#8230; instead follow negative&nbsp;hearsay and the opinions of someone you don&#8217;t even know<\/em><\/p>\n<h2>Ridiculous!&nbsp; Make up your OWN MIND, your&nbsp;ability is based off of your instructor, their experience, the training and your dedication!<\/h2>\n<p>I have seen extremely effective martial artists from every style and I have also seen horrible instructors from the same styles teaching with tons of students.&nbsp; In fact I have seen&nbsp; more martial art instructors that couldn&#8217;t teach a student to fight out of a wet&nbsp;paper bag and have hundreds of students then great instructors teaching real techniques with a small amount of students.&nbsp; The same martial art style school 20-40 minutes away with a&nbsp;smaller following because they actually teach, push and really instructing their students to learn and know how to use the material on the street against resistance.<\/p>\n<p>I have caught people and instructors from other arts telling others not to train in wing chun because it was made by a woman.&nbsp; I laugh because if a martial art was made to teach a 110lb woman to drop a 220lb man, then what could a 170lb+ male do with the art?&nbsp; Really?&nbsp; Blogs and new age martial artists will tell you that honor, respect and dedication are just an old practices from a dogmatic age.&nbsp;&nbsp;Look I agree some schools&nbsp;can become cult like, telling you to never questioning techniques, work in dogmatic motions that are rigid and unreactive, and have students telling you what the instructor can do but can not do anything like it themselves after 15 years.&nbsp; But how is Honor, respect, integrity and dedication to one&#8217;s own and family goals, dogmatic and see as old practice.&nbsp; If dedication, perserverance and honor are old practice then sign me and my students up because without that we are chaos.<\/p>\n<h2>Make up your own mind by trying out the martial art school and making your own opinion.<\/h2>\n<p>My issue with blogs not the exchange of opinion by the punishment, ridicule and shunning for expressing a different opinion&nbsp;or&nbsp;even looking&nbsp;up and&nbsp;making up your own mind on the martial art.&nbsp; You can&#8217;t even tell people on these online chats\/blogs that you come from a background in military combat training, mma, karate, tae kwon do, silat, boxing, jiujitsu, etc. and that you find Wing Chun to be&nbsp;extremely effective street self defense training. You will be verbally&nbsp;attacked even though you have the experience and expertise to make a informed decision and speak about it.&nbsp; Our school has a 7th Dan Shotokan Karate practitioner that has trained in Okinawa, Japan, 6th, 5th and 3rd&nbsp;Dan Taekwondo practitioners, black belts in a huge variety of martial arts, ex-marines and rangers, police officers and bouncers that have said Wing Chun is by far their choice for extreme situations and the safety\/self defense for those they are trying to protect.&nbsp; Yet anonymous individuals on blogs will say you must be stupid or have been the worst practitioner in your previous styles because Wing Chun can&#8217;t be good for you.&nbsp; It was made by a woman for God&#8217;s sake, how could it possibly be good for a man?? If you are a man, you want a man&#8217;s art not something with a power struggle, a exchange of punches and kicks&nbsp;back and forth until one of you just eventually succom to the blows and chokes delivered.<\/p>\n<h3>Experts and life time practitioners that have actually been in street fights and used their fields of expertise are telling you that Wing Chun under a seasoned instructor is one of the best choices you can make for stand up fighting.<span style=\"font-size: medium;\">&nbsp; <\/span><\/h3>\n<p>Lets look at&nbsp;Wing Chun&#8217;s&nbsp;practitioners to prove our point. Bruce Lee&#8217;s most influential martial art and his only formal training in the martial arts came from years of dedication under the modern founder of Wing Chun (Ving Tsun) Ip Man. Bruce Lee is known in the Mixed Martial Art world as a visionary and the 1st leader in MMA cross training.&nbsp; In case you didn&#8217;t know and I am speaking from our lineage only, Wing Chun encourages every instructor and practitioner to seek out, study and understand the techniques, attacks &amp; holds of other martial arts.&nbsp; This is so that a Wing Chun Kung Fu practitioner can become better using Wing Chun&nbsp;and fighting with it intelligently in a street fight.&nbsp; In our school we believe that if you have never seen a technique or practiced against it then you may be suprised by it.&nbsp; The great part is that Wing Chun attracts people who have never trained to great martial arts and masters that have achieved lifetimes in their previous styles of self defense.<\/p>\n<h2>If you don&#8217;t know what another martial art is going to do, then you may get caught off guard.<\/h2>\n<p>Look at the 1st UFC cage fight with Royce Gracie, his arm bars from the guard and choke holds surprised everyone,&nbsp;when asked how&nbsp;he won he said&nbsp;it was because no one had&nbsp;fought his type of jiujitsu before.&nbsp;&nbsp;Now go into any variety of martial art schools today and you will see people training on arm bars and how to get out of them, even children are now trained in these&nbsp;jiujitsu techniques.&nbsp; This is not to say that they are not powerful, in fact they are extremely effective but martial artists saw something effective, quick and fast and wanted to understand it and hopefully not get caught by it in the future if ever faced against it. &nbsp;Thus since their inception these types of techniques no longer surprise people and their are about a 1000 sites you can visit and even more youtube videos then you may ever be able to watch showing you how to execute, stop and reverse these moves. Education and adaptation&nbsp;is key to becoming a great martial artist and the reason why so many black belts and ex-military are at our school is because WIng Chun trains this everyday.&nbsp; Training and educating a practitioner to never be surprised by various styles and techniques but rather just react offensively is the way of&nbsp;Wing Chun. Education in the martial arts is essential in training and understanding the power of Wing Chun.<\/p>\n<h2>Bruce Lee has countless videos of him training and pushing his abilities in Wing Chun known as&nbsp;a primary&nbsp;engine&nbsp;of JKD<\/h2>\n<p>Bruce Lee had countless fights and challenges for teaching Wing Chun (Ving Tsun) to the &#8220;round eye&#8221; (that&#8217;s you and me unless you are absolutely 100% pure chinese, 99% doesn&#8217;t count- your still considered a heathen in those times and unworthy of Wing Chun, &#8220;no secret kung fu for you!&#8221;) Wing Chun (Ving Tsun) is what Bruce Lee used to fight and defend his title, his life, and his family. It is what made him a great practitioner in Life and in Hollywood. Actors came from everywhere to train with him, heavy weight boxers couldn&#8217;t touch him even at the age of 16 years old (according to James Demile an original student of Bruce Lee&#8217;s and a heavy weight boxer). &#8220;By the way James Demile is awesome, a very down to earth guy and if you ever get a chance to meet him he is the kind of guy you could have a beer with and then beat up the guys in the parking lot trying to mug you, always with a smile.&#8221; Bruce Lee developed Jeet Kune Do &#8220;JKD&#8221; with the core engine of JKD being Wing Chun Kung Fu (Ving Tsun).<\/p>\n<p>Its funny that I have heard some people state that Bruce Lee&nbsp;despised the art of Wing Chun.&nbsp; Yet I have seen more countless video&#8217;s&nbsp;showing him training in Chi Sau, Wooden Dummy, Wrist -vs- Wrist fighting, Chain Punching, Reaction Drills, and of course the &#8220;one inch punch&#8221;.&nbsp; All of these drills and techniques are completely and wholeheartedly claimed and owned by Wing Chun&nbsp;(no add-ins, mixed components or mixed styles, these are all pure Wing Chun Training). The Intercepting Fist is directly taught and trained constantly as the core of Wing Chun (Ving Tsun Fighting Power). Wing Chun uses the&nbsp;its intercepting fists throughout the art as a effective redirecting tool.&nbsp; Yet look&#8230; JKD is described&nbsp;as the way of the intercepting fist.&nbsp; A direct Wing Chun link, maybe even&nbsp;a tribute to Ip Man his first and honored teacher or Wong Shun Leung and Wing Chun (Ving Tsun).&nbsp; Bruce Lee never finished the art of Wing Chun but you can see constant reminders of his love for the style, because no one constantly practices a style they despise nor do they video tape themselves to see how well they are doing and where they could improve.<\/p>\n<h2>Bruce Lee&#8217;s ONLY formal instructors were Wong Shun Leung and Ip Man, both Wing Chun Masters<\/h2>\n<p>Bruce Lee supposedly did a challenge fight with Wong Shun Leung after his creation of Jeet Kune Do at the pinnacle of his fighting career. Supposedly,&nbsp;&#8220;the king of the talking hands&#8221;, Wong Shun Leung, a pure stylist of Wing Chun (Ving Tsun) fought Bruce Lee and this is why Bruce Lee asked him to finish him out in the Wing Chun system.&nbsp; I have heard instructors and places online tell that they had a even match and others say that Bruce Lee was so impressed by the full fighting use of Wong Shun Leungs Wing Chun he asked him to be his second and only formal teacher besides Ip Man.&nbsp; Though there is no proof of what happened during the fight only hearsay, what we do know is Bruce Lee had a great respect for his senior in the art of Wing Chun, we do know that Wong Shun Leung was Bruce Lee&#8217;s second teacher and that both loved Wing Chun deeply.&nbsp; Wong Shun Leung had known Bruce Lee since he was a young man and had trained side by side with him under Ip Man the Great Grandmaster and Founder of Modern Wing Chun (Ving Tsun).&nbsp; Making the only formal teachers in Bruce Lee&#8217;s entire life Ip Man and Wong Shun Leung both of them life long Wing Chun Kung Fu Instructors.&nbsp; What was it about Wing Chun that made Bruce Lee train it as a child, develop Jeet Kune Do and then come back as a Adult and want the rest.&nbsp; Why are the only formal teachers Bruce Lee wanted were always from the Wing Chun Kung Fu style.&nbsp; Bruce Lee sought out the best and&nbsp;travelled&nbsp;because he knew the benefits he would&nbsp;gain by not taking the easy route.&nbsp; Bruce Lee saw what you may see today if you find the right Wing Chun&nbsp;instructor.<\/p>\n<p>Wong Shun Leung is a legend in the martial arts world as a top fighter and visionary with over +100 wins in no rules, no gear, no holds-bar fights, and no loses using Wing Chun (Ving Tsun). Wong Shun Leung is a combat artist, seeking the deeper understandings and applications of the martial arts and how to use them. When the Art of Wing Chun Kung Fu (Ving Tsun) was finally revealed to the mass population, it was ridiculed by other martial artists for being a &#8220;Woman&#8217;s Art&#8221;. Wong Shun Leung gladly backed the legitimacy of the style of Wing Chun (VIng Tsun) through challenge fights. Wong Shun Leung was renowned for winning all of these challenge fights using Wing Chun (Ving Tsun). He proved to anyone from any style that this &#8220;Woman&#8217;s Art&#8221; was extremely powerful and effective. He took challenges from Professional Boxers, Japanese, Chinese, Korean, and European Martial Artist. Anyone from anywhere who wanted to fight Wong Shun Leung soon found themselves at the end of his fists. Wing Chun (Ving Tsun) was created and passed down from a extremely high ranking Southern Shaolin Sil Lum Temple Master &amp; Buddist Nun -Ng Miu. The art was created to make a weaker man or woman capable of beating and destroying an attacker of larger size and strength in the most horrible and life threatening situations possible. This art was created and refined through 5000 years of Chinese war, shaolin combat techniques, and modernized in a day in age with guns, cannons, swords and knives. This is not to say Wong Shun Leung was invincible, he was hit, kicked, punched and elbowed in these fights but because of his heart and his training in Wing Chun he came out the victor, knocking down or out his opponent&#8217;s.&nbsp; As Wong Shun Leung took these challenges he was never beaten, a man seeking the heart of Wing Chun (Ving Tsun). A&nbsp;man with a passion and respect for the art and its ability to protect the innocent and weak using Wing Chun.<\/p>\n<h2>Wing Chun is possibly one of the most widely known gung fu arts in the world.<\/h2>\n<p>Its centerline theory radiates from many kung fu chinese styles used in war and personal protection and has been attempted to be incorporated in many other styles (Krav Maga anyone? Anyone who says otherwise has never looked at the two, check the blocking and attacking, check the double jum sau&#8217;s used in Krav Maga -vs- Wing Chun (Ving Tsun). They are the same, except Wing Chun is 350 years old!<\/p>\n<h2>Why would I tell you not to practice Wing Chun?<\/h2>\n<p>If not willing to seek out a real practitioner or instructor that constantly strives to know, understand, and execute the complete style of Wing Chun Kung Fu in a combative manner. Instead you may seek out a instructor that is close or easy and that has taken Wing Chun Kung Fu techniques off of DVD&#8217;s, Youtube or poor previous training in bits and pieces and misrepresented it in their schools and media outlets. Many of these &#8220;instructors&#8221; have seen few moves on youtube or in a DVD and then teach them to you on the floor as &#8220;trained full fitted and certified representatives in the art of Wing Chun (Ving Tsun)&#8221;. These fake instructors give authentic Wing Chun Practitioners a bad name. Once you have done REAL Wing Chun, you can spot them instantly, but if you have no background in the style then you may never know (that is why I love youtube). Look up practitioners and you will see if they know or don&#8217;t know, spar with them, see if they practice and train with the class. There are so many ways to tell if you are at the right place or not <strong>(<em>LOOK for a REAL WING CHUN INSTRUCTOR<\/em>). <\/strong><\/p>\n<p>Wing Chun has even received misleading reports that it doesn&#8217;t have any types of snapping uppercuts, elbows, knees, head butt&#8217;s, chops, short inside hooks, footwork, angles, kicks, power, reality resistance drills, or endurance training. My first thought to these reports&#8230; MAN, what does my art do besides chain punch and sit around doing forms all day.&nbsp; Which I feel is odd since there are only three forms in the entire system because the system is based on doing 90% reactionary drills\/techniques\/combinations\/ and survival practice with a resisting fighting opponent.<\/p>\n<h2>The Best Wing Chun practitioners, finished the system and sparred constantly.<\/h2>\n<p>Lo0k at the best practitioners in Wing Chun, the ones closest to Ip Man, the modern founder of Wing Chun. You will find these practitioners fighting\/sparring against other styles, practicing against resisting opponents, and constantly pushing their bodies, minds and Wing Chun survival techniques by training in every aspect of the Whole art, not just a piece or two. Individuals, blogs and articles have said that since Wing Chun was finished out by or created by a woman that it is no good for men and has no power. Which in Wing Chun circles is a topic of laughter, because if you can teach a short Chinese woman at 90 lbs 4&#8242; 7&#8243; to stop a male aggressor twice her size and weight, apparently knowing that kind of martial skill wouldn&#8217;t be just the kind of power a 190 lb 5&#8242; 10&#8243; man would want to get his hands on?<\/p>\n<p>Your gender does effect the quantity of your muscles but not the quality. Muscle tissues are characteristically the same in both men and women, though because testosterone increases muscle size men usually have much more muscle tissue than women do. Men are generally stronger in their upper body because they usually have larger muscles and thus more power. Though woman may have less muscle mass they have the same types of muscle fibers. Thus if a woman created Wing Chun to fight a man, how would a man fair with the same art? How effective could he become in Wing Chun having more strength and power combined with the fast reflexes and reaction of a Woman&#8217;s system of fighting?? Remember the people and martial artists on these blogs, articles and sites don&#8217;t want you to train in Wing Chun. Misleading people, discrediting the art online, and harassing you if you mention anything about Wing Chun being effective is there best weapon in stopping you from studying Wing Chun (Ving Tsun) or even seeking out a good instructor that can teach you. Their hope is to weed out and stop the future development of this effective style of fighting. Without new and dedicated students training under instructors that are VERY GOOD in the martial arts these instructors can&#8217;t pass on their skills. With No new Master&#8217;s or Instructors you kill the skill and art as a whole. If a high ranking martial artist doesn&#8217;t pass on their skills and abilities then the art, skill and ability goes with them.<\/p>\n<h2>Seek out the best to become the best.<\/h2>\n<p>Ever argue with a woman? Now try fighting one that was bound and determined to destroy and devastate everything about you. How far would she go, what wouldn&#8217;t she do, how far would she push herself? What would she want to know and be able to do to complete the task without much effort or risk to herself? Second, because if it was good enough for a woman to shut down a man with half his muscle fibers then it is definitely good enough for a man to use to protect himself and his loved ones. Not if, but when a woman would have to fight a man, she would have to be able to hold her own, not just in body conditioning but also in power. Thus a woman would also have to work to redirect and use softness and hardness in a fight to get out of the way. Since she would know that softness alone is not going to finish an attacker, she would have to train harder and know tactics that could over come his brutal strength and prior training. That is why Wing Chun redirects and attacks at the same time. That is why we work on speed and angles of attack, why we condition on heavy bags, sand bags, focus mitts, training pads, gear and spar in drills, sticking hands, sensitivity fighting and free fighting to increase power, awareness, reaction and combat relative ability. Remember that if you are training in a “woman&#8217;s martial art” then it is probably going to push you hard and have tactics that might be useful against other “male” martial arts. Have you ever tried to get a hold of a feral cat? Yea that&#8217;s what I thought. Depending on the history you rely on, Ip Man; the modern founder of Wing Chun Kung Fu, told us that the creator Ng Mui (woman Buddhist nun) passed it onto Yim Wing Chun (the daughter of a bean curd salesman) just in case Ng Mui got caught by the Manchurian Dynasty. Who would have ever thought to look for the daughter of a bean curd salesman?<\/p>\n<p>Once this info was passed down from Ng Mui to Yim Wing Chun, it was then passed down to her husband Leung Bok Chau who then passed it onto a succession of men who have continued passing the art. From its creation as one of the first martial arts to be finished and created by a woman and passed down to another woman, it has been men that have continued to hold the torch waiting for women to grab hold and run with it once again, or at least side by side as equals if they will have us once they get their art back. Think of the speed you have seen in Wing Chun then place a knife in its hand. Would you call that weak? Or would you want the speed, the trapping, the ability to feel, strike and understand this kind of power. Think of its practitioners of Wing Chun, have they been known for weaknesses; Ip Man, Wong Shun Leung, a man undefeated in over a 100 no rules bouts against men twice his size. The legendary Bruce Lee was taught by Ip Man and Wong Shun Leung, and Simon Lau (who was named #1 European Human Weapon using the art of Wing Chun) Yip Ching and Yip Chun (the two sons of the Founder Ip Man), G.Master Steve Lee Swift (a man of remarkable speed, knowledge and power), the list goes on. My name is Sifu Justin Och. I teach the next generation of Wing Chun Kung Fu practitioners at the Downtown Lakeland, Florida Martial Arts and Kung Fu Center. I seek to make every woman, man, teen and child that comes in my door the best they can possibly be, the best survival practitioners, the best martial artists, the best in Wing Chun (Ving Tsun) that I can make. So here it is, if a woman helped create a martial art to shut down and destroy the arts of men, then why wouldn&#8217;t a man, given the opportunity, learn such a well thought out plot. A woman bound on freedom, liberation for her people, empowering the weak and making them strong, bound and determined to destroy and devastate everything about you should desire to train in Wing Chun. How far would she go, what wouldn&#8217;t she do? This is Wing Chun (Ving Tsun).<\/p>\n<p>I hope this article was helpful, it is my opinion and thus is not perfect but I believe in a style saved the lives of my students,&nbsp;protected them from rape and hospitalization.&nbsp; I believe in a style&nbsp;I have had to personally use on the street as&nbsp;well as in and out of the&nbsp;kwoon (dojo \/ school) and&nbsp;overseas.&nbsp; I personally believe in a style backed by Bruce Lee,&nbsp;Ip Man, and Wong Shun Leung as a street martial art.&nbsp; I also beleive we should come together as martial artists to make each other stronger in friendship and in self protection of our loved ones no matter what style of martial art you lead your life with.&nbsp;&nbsp; Oh and the picture to this article is two of my Wing Chun Students.<\/p>\n<h3><span style=\"color: #ff0000;\">“Maybe there is something to a martial art that no other martial artist wants you to even look at.”<\/span><\/h3>\n<p>Written by Chief Instructor;<\/p>\n<p>SIFU Justin Och<\/p>\n<p>(863) 800-0171<\/p>\n<p>Downtown Lakeland Kung Fu and Martial Arts<\/p>\n<p>116 East Pine Street, Lakeland Florida<\/p>\n<p>For more info watch this <a href=\"https:\/\/www.youtube.com\/watch?v=TNVHMpuZw3k\">videos<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Why people say not to train in Wing Chun and the weaknesses of Wing Chun or Wing Chun Sucks&nbsp;&#8230; Misleading reports, fake&nbsp;instructors with only&nbsp;bits and pieces of Wing Chun (Ving Tsun), difficulty finding a real wing chun instructor and martial artist attempting to teach youtube wing chun kung fu within their schools without any real [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":704,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[3],"tags":[],"class":[2027],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Wing chun sucks, Wing chun weaknesses, Train wing chun<\/title>\n<meta name=\"description\" content=\"train in wing chun, wing chun sucks, ving tsun sucks, wing chun weaknesses, wing chun sucks, worse martial arts, why not train in wing chun sucks\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Wing chun sucks, Wing chun weaknesses, Train wing chun\" \/>\n<meta property=\"og:description\" content=\"train in wing chun, wing chun sucks, ving tsun sucks, wing chun weaknesses, wing chun sucks, worse martial arts, why not train in wing chun sucks\" \/>\n<meta property=\"og:url\" content=\"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/\" \/>\n<meta property=\"og:site_name\" content=\"Sifu Och Wing Chun\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sifuochwingchun\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/sifuochwingchun\" \/>\n<meta property=\"article:published_time\" content=\"2012-07-25T15:11:07+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-09-07T02:51:45+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/sifuochwingchun.s3.amazonaws.com\/wp-content\/uploads\/2012\/07\/24100946\/wing-chun-sucks-article-wing-chun-weaknesses.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"615\" \/>\n\t<meta property=\"og:image:height\" content=\"226\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Sifu Justin Och\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SifuOchWingChun\" \/>\n<meta name=\"twitter:site\" content=\"@SifuOchWingChun\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Sifu Justin Och\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"23 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/\",\"url\":\"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/\",\"name\":\"Wing chun sucks, Wing chun weaknesses, Train wing chun\",\"isPartOf\":{\"@id\":\"https:\/\/sifuochwingchun.com\/#website\"},\"datePublished\":\"2012-07-25T15:11:07+00:00\",\"dateModified\":\"2020-09-07T02:51:45+00:00\",\"author\":{\"@id\":\"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3\"},\"description\":\"train in wing chun, wing chun sucks, ving tsun sucks, wing chun weaknesses, wing chun sucks, worse martial arts, why not train in wing chun sucks\",\"breadcrumb\":{\"@id\":\"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/sifuochwingchun.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"News\",\"item\":\"https:\/\/sifuochwingchun.com\/category\/wing-chun-news\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Why people may tell you Wing Chun Sucks&#8230;.\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/sifuochwingchun.com\/#website\",\"url\":\"https:\/\/sifuochwingchun.com\/\",\"name\":\"Sifu Och Wing Chun\",\"description\":\"Kung Fu and Martial Arts for Kids &amp; Adults in Lakeland, Florida\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/sifuochwingchun.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3\",\"name\":\"Sifu Justin Och\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/sifuochwingchun.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g\",\"caption\":\"Sifu Justin Och\"},\"description\":\"Sifu Justin Och has direct Ip Man lineage instruction under the Ip Ching, Ip Chun, Simon Lau, and Moy Yat system and spent his life training and advancing students in the Wing Chun Kung Fu system here in Lakeland Florida. He is also the Southeastern USA Regional Director of the World Ving Tsun Association for the America's.\",\"sameAs\":[\"https:\/\/sifuochwingchun.com\",\"https:\/\/www.facebook.com\/sifuochwingchun\",\"https:\/\/twitter.com\/SifuOchWingChun\"],\"url\":\"https:\/\/sifuochwingchun.com\/author\/justin-och\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Wing chun sucks, Wing chun weaknesses, Train wing chun","description":"train in wing chun, wing chun sucks, ving tsun sucks, wing chun weaknesses, wing chun sucks, worse martial arts, why not train in wing chun sucks","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/","og_locale":"en_US","og_type":"article","og_title":"Wing chun sucks, Wing chun weaknesses, Train wing chun","og_description":"train in wing chun, wing chun sucks, ving tsun sucks, wing chun weaknesses, wing chun sucks, worse martial arts, why not train in wing chun sucks","og_url":"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/","og_site_name":"Sifu Och Wing Chun","article_publisher":"https:\/\/www.facebook.com\/sifuochwingchun","article_author":"https:\/\/www.facebook.com\/sifuochwingchun","article_published_time":"2012-07-25T15:11:07+00:00","article_modified_time":"2020-09-07T02:51:45+00:00","og_image":[{"width":615,"height":226,"url":"https:\/\/sifuochwingchun.s3.amazonaws.com\/wp-content\/uploads\/2012\/07\/24100946\/wing-chun-sucks-article-wing-chun-weaknesses.jpg","type":"image\/jpeg"}],"author":"Sifu Justin Och","twitter_card":"summary_large_image","twitter_creator":"@SifuOchWingChun","twitter_site":"@SifuOchWingChun","twitter_misc":{"Written by":"Sifu Justin Och","Est. reading time":"23 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/","url":"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/","name":"Wing chun sucks, Wing chun weaknesses, Train wing chun","isPartOf":{"@id":"https:\/\/sifuochwingchun.com\/#website"},"datePublished":"2012-07-25T15:11:07+00:00","dateModified":"2020-09-07T02:51:45+00:00","author":{"@id":"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3"},"description":"train in wing chun, wing chun sucks, ving tsun sucks, wing chun weaknesses, wing chun sucks, worse martial arts, why not train in wing chun sucks","breadcrumb":{"@id":"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/sifuochwingchun.com\/weaknesses-wing-chun-sucks\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/sifuochwingchun.com\/"},{"@type":"ListItem","position":2,"name":"News","item":"https:\/\/sifuochwingchun.com\/category\/wing-chun-news\/"},{"@type":"ListItem","position":3,"name":"Why people may tell you Wing Chun Sucks&#8230;."}]},{"@type":"WebSite","@id":"https:\/\/sifuochwingchun.com\/#website","url":"https:\/\/sifuochwingchun.com\/","name":"Sifu Och Wing Chun","description":"Kung Fu and Martial Arts for Kids &amp; Adults in Lakeland, Florida","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/sifuochwingchun.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/sifuochwingchun.com\/#\/schema\/person\/792033787db1fa3110c869d36eb5feb3","name":"Sifu Justin Och","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/sifuochwingchun.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/43b59492cae5781cb9938879ea6ca046?s=96&d=wp_user_avatar&r=g","caption":"Sifu Justin Och"},"description":"Sifu Justin Och has direct Ip Man lineage instruction under the Ip Ching, Ip Chun, Simon Lau, and Moy Yat system and spent his life training and advancing students in the Wing Chun Kung Fu system here in Lakeland Florida. He is also the Southeastern USA Regional Director of the World Ving Tsun Association for the America's.","sameAs":["https:\/\/sifuochwingchun.com","https:\/\/www.facebook.com\/sifuochwingchun","https:\/\/twitter.com\/SifuOchWingChun"],"url":"https:\/\/sifuochwingchun.com\/author\/justin-och\/"}]}},"_links":{"self":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/posts\/701"}],"collection":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/comments?post=701"}],"version-history":[{"count":0,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/posts\/701\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/media\/704"}],"wp:attachment":[{"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/media?parent=701"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/categories?post=701"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/tags?post=701"},{"taxonomy":"class","embeddable":true,"href":"https:\/\/sifuochwingchun.com\/wp-json\/wp\/v2\/class?post=701"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}